In [1]:
import numpy as np
import pandas as pd

### 16. Write a python program to remove all entries with a null value present.

In [2]:
df = pd.read_csv('lap_times.csv')
df.head()

   raceId  driverId  lap  position      time  milliseconds
0     841        20    1         1  1:38.109         98109
1     841        20    2         1  1:33.006         93006
2     841        20    3         1  1:32.713         92713
3     841        20    4         1  1:32.803         92803
4     841        20    5         1  1:32.342         92342

In [3]:
df.shape

(495544, 6)

In [9]:
df['raceId'].isna().sum(),df['driverId'].isna().sum(),df['lap'].isna().sum(),df['position'].isna().sum(),df['time'].isna().sum()

(0, 0, 0, 0, 0)

In [7]:
df.shape

(495544, 6)

In [12]:
df['raceId'].isnull().sum(),df['driverId'].isnull().sum(),df['lap'].isnull().sum(),df['position'].isnull().sum(),df['time'].isnull().sum()

(0, 0, 0, 0, 0)

### 17. Write a python program to replace all missing values in the dataset with a desired value accepted from the user.

In [16]:
data = {'one': pd.Series([1, 2, 5], index=['a', 'b', 'e']),
         'two': pd.Series([1, 2, 3, 4],  index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  NaN  3.0
d  NaN  4.0
e  5.0  NaN

In [17]:
df.fillna(0,inplace=True)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  0.0  3.0
d  0.0  4.0
e  5.0  0.0

### 18. Develop a Python code to impute a mean value to all the null fields present in the data provided.

In [20]:
data = {'one': pd.Series([1, 2, 5], index=['a', 'b', 'e']),
         'two': pd.Series([1, 2, 3, 4],  index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  NaN  3.0
d  NaN  4.0
e  5.0  NaN

In [19]:
df['one'].fillna(df['one'].mean(),inplace=True)
df['two'].fillna(df['two'].mean(),inplace=True)
df

        one  two
a  1.000000  1.0
b  2.000000  2.0
c  2.666667  3.0
d  2.666667  4.0
e  5.000000  2.5

In [23]:
from sklearn.impute import SimpleImputer
si = SimpleImputer(missing_values=np.nan, strategy='mean')
si.fit(df)
transformed = si.transform(df.values)

array([[1.        , 1.        ],
       [2.        , 2.        ],
       [2.66666667, 3.        ],
       [2.66666667, 4.        ],
       [5.        , 2.5       ]])

In [25]:
pd.DataFrame(transformed, columns=['one','two'])

        one  two
0  1.000000  1.0
1  2.000000  2.0
2  2.666667  3.0
3  2.666667  4.0
4  5.000000  2.5

#### Imputation using constant

In [30]:
constant_si = SimpleImputer(strategy='constant',fill_value=1000)
constant_si.fit(df)
transformed = constant_si.transform(df.values)
pd.DataFrame(transformed)

        0       1
0     1.0     1.0
1     2.0     2.0
2  1000.0     3.0
3  1000.0     4.0
4     5.0  1000.0

### 19. Write a pythonic method to convert categorical data into numerical data.

In [32]:
data = {'Customer_id': pd.Series([1,2,3,4,5]),
 'Loan_type': pd.Series(['Home Loan','Personal Loan','Education Loan','Home Loan','Car Loan']),
 'Income': pd.Series(['30K','25K','15K','40K','35K'])}
df = pd.DataFrame(data)
df

   Customer_id       Loan_type Income
0            1       Home Loan    30K
1            2   Personal Loan    25K
2            3  Education Loan    15K
3            4       Home Loan    40K
4            5        Car Loan    35K

In [34]:
def get_integer(loan_type):
    if not loan_type:
        return -1
    if loan_type == 'Home Loan':
        return 1
    elif loan_type == 'Personal Loan':
        return 2
    elif loan_type == 'Education Loan':
        return 3
    elif loan_type == 'Home Loan':
        return 4
    elif loan_type == 'Car Loan':
        return 5
    
df['loan_type_cat'] = df['Loan_type'].map(get_integer)
df

   Customer_id       Loan_type Income  loan_type_cat
0            1       Home Loan    30K              1
1            2   Personal Loan    25K              2
2            3  Education Loan    15K              3
3            4       Home Loan    40K              1
4            5        Car Loan    35K              5

In [36]:
pd.get_dummies(df['Loan_type'])

   Car Loan  Education Loan  Home Loan  Personal Loan
0         0               0          1              0
1         0               0          0              1
2         0               1          0              0
3         0               0          1              0
4         1               0          0              0

### 20. Write a pyhton program to convert all the categorical data with ordinal values in the dataset into numerical form.

In [38]:
data = {'Customer_id': pd.Series([1,2,3,4,5]),
 'Loan_type': pd.Series(['Home Loan',
 'Personal Loan',
 'Education Loan',
'Home Loan',
 'Credit Loan']),
 'Income': pd.Series(['30K','25K','15K',
 '40K','35K'])}
df = pd.DataFrame(data)
df

   Customer_id       Loan_type Income
0            1       Home Loan    30K
1            2   Personal Loan    25K
2            3  Education Loan    15K
3            4       Home Loan    40K
4            5     Credit Loan    35K

In [40]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
le.fit_transform(df['Loan_type'])

array([2, 3, 1, 2, 0])

In [41]:
df.apply(le.fit_transform)

   Customer_id  Loan_type  Income
0            0          2       2
1            1          3       1
2            2          1       0
3            3          2       4
4            4          0       3